tests/data/memtier-output/output-text.txt
2026-04-13T00:01:31.5290167Z Json file output.json created...
2026-04-13T00:01:31.5319412Z Writing results to stdout
2026-04-13T00:01:31.5334127Z [RUN #1] Preparing benchmark client...
2026-04-13T00:01:31.5342181Z [RUN #1] Launching threads now...
2026-04-13T00:01:33.5336984Z [RUN #1 20%,   0 secs]  2 threads:       39206 ops,   39209 (avg:   39209) ops/sec, 2.82MB/sec (avg: 2.82MB/sec),  0.51 (avg:  0.51) msec latency
2026-04-13T00:01:34.5360571Z [RUN #1 40%,   1 secs]  2 threads:       84133 ops,   44923 (avg:   42066) ops/sec, 3.23MB/sec (avg: 3.03MB/sec),  0.44 (avg:  0.47) msec latency
2026-04-13T00:01:35.5352102Z [RUN #1 60%,   3 secs]  2 threads:      128657 ops,   44494 (avg:   42876) ops/sec, 3.20MB/sec (avg: 3.08MB/sec),  0.45 (avg:  0.47) msec latency
2026-04-13T00:01:36.5360582Z [RUN #1 80%,   4 secs]  2 threads:      172954 ops,   44290 (avg:   43229) ops/sec, 3.18MB/sec (avg: 3.11MB/sec),  0.45 (avg:  0.46) msec latency
2026-04-13T00:01:37.5345581Z [RUN #1 100%,   5 secs]  2 threads:      217154 ops,   44198 (avg:   43423) ops/sec, 3.18MB/sec (avg: 3.12MB/sec),  0.45 (avg:  0.46) msec latency
2026-04-13T00:01:37.5347710Z [RUN #1 100%,   5 secs]  0 threads:      217172 ops,   44198 (avg:   43408) ops/sec, 3.18MB/sec (avg: 3.12MB/sec),  0.45 (avg:  0.46) msec latency
2026-04-13T00:01:37.5348900Z 
2026-04-13T00:01:37.5371348Z 2         Threads
2026-04-13T00:01:37.5372128Z 10        Connections per thread
2026-04-13T00:01:37.5372700Z 5         Seconds
2026-04-13T00:01:37.5373027Z 
2026-04-13T00:01:37.5373160Z 
2026-04-13T00:01:37.5373404Z ALL STATS
2026-04-13T00:01:37.5373991Z ============================================================================================================================
2026-04-13T00:01:37.5375137Z Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
2026-04-13T00:01:37.5376579Z ----------------------------------------------------------------------------------------------------------------------------
2026-04-13T00:01:37.5377772Z Sets        27127.17          ---          ---         0.46076         0.39100         1.77500         3.18300      2937.46 
2026-04-13T00:01:37.5378804Z Gets        27125.17        19.99     27105.18         0.45919         0.38300         1.77500         3.13500      1057.93 
2026-04-13T00:01:37.5379868Z Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
2026-04-13T00:01:37.5380728Z Totals      54252.34        19.99     27105.18         0.45997         0.38300         1.77500         3.15100      3995.39 
2026-04-13T00:01:37.5381380Z 
2026-04-13T00:01:37.5381496Z 
2026-04-13T00:01:37.5381745Z Request Latency Distribution
2026-04-13T00:01:37.5382200Z Type     <= msec         Percent
2026-04-13T00:01:37.5382767Z ------------------------------------------------------------------------
2026-04-13T00:01:37.5383424Z SET       0.039        0.000
2026-04-13T00:01:37.5383839Z SET       0.151        5.000
2026-04-13T00:01:37.5384240Z SET       0.191       10.000
2026-04-13T00:01:37.5384678Z SET       0.223       15.000
2026-04-13T00:01:37.5385116Z SET       0.247       20.000
2026-04-13T00:01:37.5385506Z SET       0.271       25.000
2026-04-13T00:01:37.5385894Z SET       0.295       30.000
2026-04-13T00:01:37.5386329Z SET       0.319       35.000
2026-04-13T00:01:37.5386793Z SET       0.343       40.000
2026-04-13T00:01:37.5387541Z SET       0.367       45.000
2026-04-13T00:01:37.5391968Z SET       0.391       50.000
2026-04-13T00:01:37.5393229Z SET       0.399       52.500
2026-04-13T00:01:37.5393688Z SET       0.415       55.000
2026-04-13T00:01:37.5394139Z SET       0.423       57.500
2026-04-13T00:01:37.5394522Z SET       0.439       60.000