tests/data/memtier-output/output.txt
Json file output.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,   5 secs]  0 threads:      217172 ops,   44198 (avg:   43408) ops/sec, 3.18MB/sec (avg: 3.12MB/sec),  0.45 (avg:  0.46) msec latency

2         Threads
10        Connections per thread
5         Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        27127.17          ---          ---         0.46076         0.39100         1.77500         3.18300      2937.46 
Gets        27125.17        19.99     27105.18         0.45919         0.38300         1.77500         3.13500      1057.93 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      54252.34        19.99     27105.18         0.45997         0.38300         1.77500         3.15100      3995.39 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.039        0.000
SET       0.151        5.000
SET       0.191       10.000
SET       0.223       15.000
SET       0.247       20.000
SET       0.271       25.000
SET       0.295       30.000
SET       0.319       35.000
SET       0.343       40.000
SET       0.367       45.000
SET       0.391       50.000
SET       0.399       52.500
SET       0.415       55.000
SET       0.423       57.500
SET       0.439       60.000
SET       0.455       62.500
SET       0.471       65.000
SET       0.487       67.500
SET       0.503       70.000
SET       0.527       72.500
SET       0.551       75.000
SET       0.559       76.250
SET       0.575       77.500
SET       0.591       78.750
SET       0.607       80.000
SET       0.623       81.250
SET       0.639       82.500
SET       0.655       83.750
SET       0.679       85.000
SET       0.703       86.250
SET       0.727       87.500
SET       0.735       88.125
SET       0.751       88.750
SET       0.775       89.375
SET       0.791       90.000
SET       0.807       90.625
SET       0.831       91.250
SET       0.847       91.875
SET       0.879       92.500
SET       0.903       93.125
SET       0.935       93.750
SET       0.959       94.062
SET       0.975       94.375
SET       0.991       94.688
SET       1.015       95.000
SET       1.039       95.312
SET       1.063       95.625
SET       1.095       95.938
SET       1.127       96.250
SET       1.167       96.562
SET       1.207       96.875
SET       1.231       97.031
SET       1.255       97.188
SET       1.287       97.344
SET       1.311       97.500
SET       1.343       97.656
SET       1.375       97.812
SET       1.415       97.969
SET       1.455       98.125
SET       1.495       98.281
SET       1.543       98.438
SET       1.567       98.516
SET       1.599       98.594
SET       1.623       98.672
SET       1.647       98.750
SET       1.695       98.828
SET       1.735       98.906
SET       1.767       98.984
SET       1.815       99.062
SET       1.863       99.141
SET       1.919       99.219
SET       1.951       99.258
SET       1.983       99.297
SET       2.007       99.336
SET       2.047       99.375
SET       2.095       99.414
SET       2.143       99.453
SET       2.175       99.492
SET       2.207       99.531
SET       2.255       99.570
SET       2.303       99.609
SET       2.319       99.629
SET       2.335       99.648
SET       2.351       99.668
SET       2.383       99.688
SET       2.415       99.707
SET       2.447       99.727
SET       2.479       99.746
SET       2.511       99.766
SET       2.559       99.785
SET       2.623       99.805
SET       2.655       99.814
SET       2.671       99.824
SET       2.719       99.834
SET       2.767       99.844
SET       2.815       99.854
SET       2.927       99.863
SET       3.007       99.873
SET       3.087       99.883
SET       3.135       99.893
SET       3.199       99.902
SET       3.231       99.907
SET       3.311       99.912
SET       3.343       99.917
SET       3.391       99.922
SET       3.439       99.927
SET       3.487       99.932
SET       3.599       99.937
SET       3.631       99.941
SET       3.775       99.946
SET       4.047       99.951
SET       4.047       99.954
SET       4.159       99.956
SET       4.447       99.958
SET       4.511       99.961
SET       4.767       99.963
SET       4.799       99.966
SET       4.863       99.968
SET       4.991       99.971
SET       5.151       99.973
SET       5.215       99.976
SET       5.311       99.977
SET       5.695       99.978
SET       5.727       99.979
SET       5.791       99.980
SET       5.887       99.982
SET       5.887       99.983
SET       5.951       99.984
SET       6.143       99.985
SET       6.207       99.987
SET       6.271       99.988
SET       6.335       99.988
SET       6.527       99.989
SET       6.527       99.990
SET       7.007       99.990
SET       7.135       99.991
SET       7.135       99.991
SET       7.167       99.992
SET       7.199       99.993
SET       7.199       99.993
SET       7.423       99.994
SET       7.423       99.994
SET       7.487       99.995
SET       7.487       99.995
SET       7.487       99.995
SET       8.255       99.995
SET       8.255       99.996
SET       8.255       99.996
SET       8.511       99.996
SET       8.511       99.997
SET       8.511       99.997
SET       8.511       99.997
SET       8.895       99.997
SET       8.895       99.997
SET       8.895       99.998
SET       8.895       99.998
SET       8.895       99.998
[...]
SET       9.279       99.998
SET       9.279       99.998
SET       9.279       99.998
SET       9.279       99.999
SET       9.279       99.999
SET       9.279       99.999
[...]
SET       9.343       99.999
SET       9.343      100.000
---
GET       0.047        0.000
GET       0.151        5.000
GET       0.191       10.000
GET       0.215       15.000
GET       0.247       20.000
GET       0.271       25.000
GET       0.295       30.000
GET       0.319       35.000
GET       0.343       40.000
GET       0.359       45.000
GET       0.383       50.000
GET       0.399       52.500
GET       0.407       55.000
GET       0.423       57.500
GET       0.439       60.000
GET       0.455       62.500
GET       0.471       65.000
GET       0.487       67.500
GET       0.503       70.000
GET       0.527       72.500
GET       0.551       75.000
GET       0.559       76.250
GET       0.575       77.500
GET       0.591       78.750
GET       0.607       80.000
GET       0.623       81.250
GET       0.639       82.500
GET       0.655       83.750
GET       0.679       85.000
GET       0.703       86.250
GET       0.727       87.500
GET       0.743       88.125
GET       0.751       88.750
GET       0.767       89.375
GET       0.791       90.000
GET       0.807       90.625
GET       0.831       91.250
GET       0.847       91.875
GET       0.879       92.500
GET       0.903       93.125
GET       0.935       93.750
GET       0.951       94.062
GET       0.975       94.375
GET       0.991       94.688
GET       1.015       95.000
GET       1.039       95.312
GET       1.063       95.625
GET       1.095       95.938
GET       1.135       96.250
GET       1.175       96.562
GET       1.215       96.875
GET       1.239       97.031
GET       1.263       97.188
GET       1.295       97.344
GET       1.319       97.500
GET       1.351       97.656
GET       1.383       97.812
GET       1.407       97.969
GET       1.447       98.125
GET       1.487       98.281
GET       1.535       98.438
GET       1.559       98.516
GET       1.591       98.594
GET       1.623       98.672
GET       1.655       98.750
GET       1.687       98.828
GET       1.727       98.906
GET       1.767       98.984
GET       1.807       99.062
GET       1.847       99.141
GET       1.895       99.219
GET       1.927       99.258
GET       1.967       99.297
GET       1.999       99.336
GET       2.031    Json file closed.
   99.375
GET       2.079       99.414
GET       2.127       99.453
GET       2.191       99.492
GET       2.223       99.531
GET       2.255       99.570
GET       2.319       99.609
GET       2.335       99.629
GET       2.367       99.648
GET       2.383       99.668
GET       2.431       99.688
GET       2.447       99.707
GET       2.479       99.727
GET       2.511       99.746
GET       2.543       99.766
GET       2.591       99.785
GET       2.639       99.805
GET       2.671       99.814
GET       2.687       99.824
GET       2.751       99.834
GET       2.815       99.844
GET       2.863       99.854
GET       2.943       99.863
GET       2.991       99.873
GET       3.023       99.883
GET       3.103       99.893
GET       3.151       99.902
GET       3.183       99.907
GET       3.247       99.912
GET       3.279       99.917
GET       3.343       99.922
GET       3.455       99.927
GET       3.503       99.932
GET       3.583       99.937
GET       3.647       99.941
GET       3.775       99.946
GET       3.823       99.951
GET       3.887       99.954
GET       3.967       99.956
GET       4.031       99.958
GET       4.127       99.961
GET       4.223       99.963
GET       4.351       99.966
GET       4.447       99.968
GET       4.479       99.971
GET       4.543       99.973
GET       4.895       99.976
GET       4.927       99.977
GET       4.991       99.978
GET       5.119       99.979
GET       5.151       99.980
GET       5.215       99.982
GET       5.343       99.983
GET       5.471       99.984
GET       5.631       99.985
GET       5.919       99.987
GET       5.919       99.988
GET       5.919       99.988
GET       5.951       99.989
GET       5.951       99.990
GET       6.079       99.990
GET       6.111       99.991
GET       6.111       99.991
GET       6.143       99.992
GET       6.143       99.993
GET       6.143       99.993
GET       6.367       99.994
GET       6.367       99.994
GET       6.975       99.995
GET       6.975       99.995
GET       6.975       99.995
GET       7.071       99.995
GET       7.071       99.996
GET       7.071       99.996
GET       7.615       99.996
GET       7.615       99.997
GET       7.615       99.997
GET       7.615       99.997
GET       9.151       99.997
GET       9.151       99.997
GET       9.151       99.998
GET       9.151       99.998
GET       9.151       99.998
[...]
GET       9.279       99.998
GET       9.279       99.998
GET       9.279       99.998
GET       9.279       99.999
GET       9.279       99.999
GET       9.279       99.999
[...]
GET       9.663       99.999
GET       9.663      100.000
---
WAIT      0.000      100.000